runTestCases/initialCases/3.1_ANSJ/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
-0.193997
-0.18883
-0.183572
-0.178233
-0.172826
-0.167358
-0.161841
-0.156286
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.3048
-0.3048
-0.3048
-0.3048
-0.3048
-0.3048
-0.3048
-0.3048
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
-0.298813
-0.287027
-0.275587
-0.26445
-0.253573
-0.242914
-0.232432
-0.222088
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.196571
-0.196571
-0.196571
-0.196571
-0.196571
-0.196572
-0.196572
-0.196572
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
2.032
2.032
2.032
2.032
2.032
2.032
2.032
2.032
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.194032
-0.188843
-0.183535
-0.178119
-0.172613
-0.167038
-0.16142
-0.15578
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-0.298816
-0.287033
-0.275595
-0.264461
-0.253586
-0.242929
-0.23245
-0.222109
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
-1.03322e-19
-3.31666e-19
-6.0762e-19
-9.40182e-19
-1.33962e-18
-1.81746e-18
-2.38633e-18
-3.05971e-18
-3.85143e-18
-4.77491e-18
-5.84215e-18
-7.06242e-18
-8.44078e-18
-9.97645e-18
-1.16614e-17
-1.34796e-17
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
