runTestCases/initialCases/3.1_ANSJ/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
294.4397
294.43562
294.42926
294.42023
294.40801
294.39201
294.37159
294.34594
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    inflow2
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 294.44;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 294.44;
        value           nonuniform List<scalar> 
112
(
294.96633
294.96623
294.96598
294.96558
294.96501
294.96427
294.96335
294.96225
...
)
;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    wall3
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
