runTestCases/initialCases/3.1_ANSJ/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0.05";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
18080
(
(23.452171 2.1190187e-11 -0.00062501528)
(23.584228 3.6360292e-11 -0.0030762646)
(23.818807 -8.5013984e-10 -0.0051987932)
(24.154653 7.4039672e-11 -0.0074996186)
(24.606194 9.7063216e-11 -0.010039147)
(25.189646 1.0305459e-10 -0.012876814)
(25.920159 -1.2676645e-09 -0.016043146)
(26.813483 -1.0656477e-09 -0.019558794)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            freestreamVelocity;
        freestreamValue uniform (3.4396 0 0);
        value           uniform (3.4396 0 0);
    }
    inflow2
    {
        type            freestreamVelocity;
        freestreamValue uniform (3.4396 0 0);
        value           nonuniform List<vector> 
158
(
(3.4399084 -4.8452011e-18 -0.0030234943)
(3.4398655 -7.3452786e-18 -0.005896059)
(3.4399308 -7.1552929e-18 -0.0082949498)
(3.4400613 4.7911123e-16 -0.010193616)
(3.4402066 1.1994757e-12 -0.011694618)
(3.4403682 2.3862155e-12 -0.012967272)
(3.4405526 2.3758709e-12 -0.01419849)
(3.4407631 2.3661058e-12 -0.015550291)
...
)
;
    }
    inlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
48
(
(23.452168 0 0.0077356678)
(23.451674 0 0.0073198346)
(23.450898 1.1286328e-17 0.0083181993)
(23.449473 -5.6050624e-18 0.0077703646)
(23.447166 0 0.0076194113)
(23.443339 6.8936125e-18 0.0077988481)
(23.437103 0 0.007941017)
(23.427141 0 0.0078778595)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            noSlip;
    }
    wall2
    {
        type            noSlip;
    }
    wall3
    {
        type            noSlip;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
