runTestCases/initialCases/3.1_ANSJ/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
8.0516124e-08
1.1395604e-07
1.1791133e-07
9.2864397e-08
7.5316124e-08
6.2702253e-08
5.3410365e-08
2.414135e-09
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
6.4208713e-10
1.0623431e-09
1.6221647e-09
2.380774e-09
3.4343632e-09
4.9432361e-09
7.1797242e-09
1.0616999e-08
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
4.1276723e-08
4.1275578e-08
4.1275401e-08
4.1275274e-08
4.1275215e-08
4.1275217e-08
4.1275272e-08
4.1275384e-08
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
7.7116939e-08
7.7436951e-08
7.7423749e-08
7.7932309e-08
7.8414635e-08
7.9282396e-08
8.0706826e-08
8.3004804e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0.35896102
0.35892215
0.35897586
0.35920149
0.35951773
0.35993263
0.36045814
0.36113611
...
)
;
    }
    wall1
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
48
(
4.6746523e-09
1.5276552e-09
1.1469412e-09
9.675926e-10
1.0399964e-09
1.2868964e-09
1.4938849e-09
1.7109806e-09
...
)
;
    }
    wall2
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
30
(
9.9689199e-09
2.4850442e-09
1.4009928e-09
1.1366363e-09
9.9974728e-10
9.3834518e-10
9.2774988e-10
9.6010371e-10
...
)
;
    }
    wall3
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
16
(
0.00045986622
0.00043738306
0.00039754236
0.00032366125
0.00022192643
0.00012930382
7.8419816e-05
6.0971891e-05
5.5394901e-05
5.3524736e-05
5.4180803e-05
5.6676444e-05
6.0333973e-05
6.3946511e-05
6.8469183e-05
7.2516568e-05
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
