runTestCases/initialCases/3.1_ANSJ/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
1.1564123e-05
1.1601492e-05
1.1686821e-05
1.1810375e-05
1.1975301e-05
1.2185033e-05
1.2442398e-05
1.2449806e-05
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 4.624e-05;
        value           uniform 4.624e-05;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 4.624e-05;
        value           uniform 4.624e-05;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 4.624e-05;
        value           uniform 4.624e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
48
(
0.1343485
0.030826471
0.021043876
0.016642129
0.017754965
0.022614827
0.026871679
0.031770939
...
)
;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
30
(
0.014649144
0.00249893
0.0011737157
0.00089143879
0.00075263162
0.00069174216
0.00068065463
0.00071087382
...
)
;
    }
    wall3
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
16
(
827.5959
787.4379
718.80146
598.03819
422.71836
263.74187
174.22583
136.96389
116.61968
98.323924
76.479729
59.273224
47.981901
38.159368
28.657922
20.460623
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
