runTestCases/initialCases/3.1_ANSJ/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
3.6287376e-08
5.1358591e-08
5.3142754e-08
4.1856035e-08
3.3948915e-08
2.8265784e-08
2.4079991e-08
1.0885804e-09
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
5.368297e-10
8.8819308e-10
1.3562432e-09
1.9904936e-09
2.8713681e-09
4.1328918e-09
6.0027529e-09
8.8765562e-09
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
3.4509019e-08
3.4508062e-08
3.4507913e-08
3.4507806e-08
3.4507757e-08
3.4507758e-08
3.4507803e-08
3.4507896e-08
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
3.4755821e-08
3.4900042e-08
3.4894085e-08
3.5123274e-08
3.534063e-08
3.5731683e-08
3.6373595e-08
3.7409163e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0.3006637
0.30063227
0.30067686
0.30086526
0.30112944
0.30147607
0.30191515
0.3024817
...
)
;
    }
    wall1
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
48
(
1.7894098e-09
5.8484013e-10
4.3910432e-10
3.7042069e-10
3.9807361e-10
4.9257173e-10
5.718307e-10
6.5499744e-10
...
)
;
    }
    wall2
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
30
(
7.0845916e-09
1.7660483e-09
9.9564403e-10
8.0777657e-10
7.1049619e-10
6.6686209e-10
6.5933507e-10
6.8233121e-10
...
)
;
    }
    wall3
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
16
(
0.00029782702
0.00028460172
0.00026093817
0.00021604609
0.00015152905
9.0282971e-05
5.5431828e-05
4.3291501e-05
3.9410587e-05
3.812099e-05
3.8608919e-05
4.0398805e-05
4.3012784e-05
4.5593623e-05
4.8821383e-05
5.1709244e-05
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
