runTestCases/initialCases/3.1_ANSJ/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
335.05273
335.52839
336.6098
338.16593
340.22619
342.81919
345.96101
346.04356
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 670;
        value           uniform 670;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 670;
        value           uniform 670;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 670;
        value           uniform 670;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
48
(
20663462
19950002
19193929
18432491
17811028
17392720
17151224
17064741
...
)
;
    }
    wall2
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
30
(
467204.02
466359.65
465623.85
464917.78
464229.88
463556.45
462893.88
462239.67
...
)
;
    }
    wall3
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
16
(
159876.27
156825.26
150543.14
137858.78
116285.76
92106.84
75034.946
66654.195
61554.314
56582.768
49952.191
44013.594
39629.179
35365.565
30672.532
25943.891
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
