runTestCases/initialCases/3.1_ANSJ/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.05";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
187957.81
187953.89
187944.3
187929.75
187909.36
187881.87
187845.95
187800.1
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
48
(
101319.02
101319.01
101319.01
101319
101319
101318.99
101318.99
101318.98
...
)
;
    }
    inflow2
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
158
(
101322.55
101322.56
101322.56
101322.56
101322.56
101322.56
101322.56
101322.57
...
)
;
    }
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 188566;
        value           nonuniform List<scalar> 
48
(
187955.82
187955.85
187955.89
187955.96
187956.08
187956.28
187956.6
187957.12
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325; 
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    wall3
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
